In [ ]:
##(1).   Create a table called employees with the following structure?
# emp_id (integer, should not be NULL and should be a primary key)Q
# emp_name (text, should not be NULL)Q
 #age (integer, should have a check constraint to ensure the age is at least 18)Q
 #email (text, should be unique for each employee)Q
 #salary (decimal, with a default value of 30,000).


create database if not exists pw;
use pw;
create table if not exists  employees(
emp_id int  primary key,
emp_name varchar(25) not null,
age int check (age>=18),
email varchar(40) unique,
salary decimal default (30000));
use pw;

ques 2   Explain the purpose of constraints and how they help maintain data integrity in a database. Provideexamples of common types of constraints.


ANS- SQL Constraints are used to specify rules for data.
Constraints restrict the type of values that can be stored in a column
 Constraints prevent duplicate records where uniqueness is required, such as for primary keys.
Constraints maintain valid relationships between tables, preventing orphaned records.

 EXAMPLE- NOT NULL
         UNIQUE
         PRIMARY KEY
         DEFAULT
         CHECK


ques 3  Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justifyyour answer.

ANS- when we have to fill the column it means when a column should not be blank that time we have to give NOT NULL constraints .

 for example SR NO , ROLL NO , ORDER ID , CUSTOMER ID .

 yes a PRIMARY KEY contains not null and unique constraints.

ques 4  Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an
example for both adding and removing a constraint

ANS- If i have a table named as employees and which have a column name as Salary and i  have to chanmge their datatypes from decimal to int  or constraints i have to follow following steps:

* ALTER employees
* MODIFY salary int;
* to drop constraints
* ALTER EMPLOYEES
* DROP CONSTRAINTS salary;

ques 5 - Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.Provide an example of an error message that might occur when violating a constraint.


ANS- If i gived salary column as int not null constraints and i want to put in any decimal no or if i forget to insert any no then SQL gives me error that salary should not be null or decimal value.

 for example insert into salary values __(empty)

 error code 1048- salary should not be null

ques 6  You created a products table without constraints as follows:

 CREATE TABLE products (

 product_id INT,

 product_name VARCHAR(50),

 price DECIMAL(10, 2));

 ans- *  ALTER TABLE products
 *   modify product_id int primary key,
 *  modify price decimal(10,2) default(50.00);

In [ ]:
#ques 7 Write a query to fetch the student_name and class_name for each student using an INNER JOIN


SELECT students.student_name, classes.class_name
FROM students
INNER JOIN classes
 ON students.class_id = classes.class_id;

In [ ]:
#(8)-Write a query that shows all order_id, customer_name, and product_name, ensuring that all products are
#listed even if they are not associated with an order
#ans-
use pw;
create table orders (
order_id int,
order_date date,
customer_id int) ;
create table customers (
customer_id int ,
customer_name varchar (50));
create table products(
product_id int,
product_name varchar(50),
order_id int );
insert into orders
values (1,'2024-01-01',101),
(2,'2024-01-03',102);
insert into customers values
(101,"Alice"),
(102,"Bob");
insert into products values
(1,"Laptop",1),
(2,"Phone",null );

SELECT orders.order_id, customers.customer_name, products.product_name
FROM products
inner JOIN orders ON products.order_id = orders.order_id
left JOIN customers ON orders.customer_id = customers.customer_id;

In [ ]:
#(9)-Write a query to find the total sales amount for each product using an INNER JOIN and the SUM
#ANS-
use pw;
create table Sales(
sale_id int,
product_id int,
ammount int);
insert into Sales values
(1,101,500),
(2,102,300),
(3,101,700);
create table Product(
product_id int,
product_name varchar(50));
insert into Product values
(101,"Laptop"),
(102,"Phone");
SELECT p.product_name, SUM(s.ammount) AS total_sales
FROM Sales s
INNER JOIN Product p ON s.product_id = p.product_id
GROUP BY p.product_name;

In [ ]:
#|(10)-Write a query to display the order_id, customer_name, and the quantity of products ordered by each
#customer using an INNER JOIN between all three tables.
#AMS=
use pw;
create table order1 (
order_id int,
order_date date,
customer_id int) ;
create table customer (
customer_id int ,
customer_name varchar (50));
create table ORDER_DETAILS(
order_id int,
product_id int,
quantity int );
insert into order1
values (1,'2024-01-01',1),
(2,'2024-01-03',2);
select*FROM ORDER1;
insert into customer values
(101,"Alice"),
(102,"Bob");
insert into ORDER_DETAILS values
(1,101,2),
(1,102,1),
(2,101,3);

select order1,order_id,customer.customer_name,ORDER_DETAILS.quantity
from ORDER_DETAILS
inner join customer
on order1.customer_id=customer.customer_id
inner join order1
on order1.order_id=ORDER_DETAILS.ORDER_ID;
SELECT order1.order_id,customer.customer_name, SUM(ORDER_DETAILS.quantity) AS total_quantity
FROM order1 o
INNER JOIN customer c ON o.customer_id = c.customer_id
INNER JOIN ORDER_DETAILS od ON o.order_id = od.order_id
GROUP BY o.order_id, c.customer_name;

**SQL Commands**

 ques 1 -Identify the primary keys and foreign keys in maven movies db. Discuss the differences.


  A primary key is a unique identifier for a record in a table. It ensures that each row in a table can be uniquely identified.

  A foreign key is a field (or collection of fields) in one table that uniquely identifies a row of another table. The foreign key is used to establish and enforce a link between the data in two tables